> I assume the provider would propose to replace the EBS volume in this case because the AZ might change, and so Terraform must be conservative and assume that it will. 

I just tested this by changing the instance config in a way that forces a replacement (and undoing the fix from earlier), and that is in fact what happens.

> Do you think plan that included a diff like the above for both the EC2 instance and the volume would be sufficient to explain to you why Terraform is proposing to replace both of them?

The plan does in fact say it's the AZ that causes the EBS deletion:

```
-/+ resource "aws_ebs_volume" "data" {
      ~ arn                  = "..." -> (known after apply)
      ~ availability_zone    = "us-east-2a" -> (known after apply) # forces replacement
      ~ encrypted            = false -> (known after apply)
...
```

It doesn't go all the way and say it's because the EC2 instance is being recycled, but I think there are enough breadcrumbs that a more patient version of myself would have noticed this and figured it out. So, what's left? I'm not really sure -- I think the main piece of insight I got from all this is how to think a little better about how dependencies are introduced.